app/controllers/api/v1/adoptions_controller.rb

  def newadoption
    uid = params[:id]
    typ = params[:type]
    br = params[:breed]
    ag = params[:age]
    des = params[:description]
    img = params[:image]
    adoption = Adoption.new({user_id: uid, pet_type: typ, breed: br, age: ag, description: des, image: img})

    if adoption.save
---
INSERT INTO "adoptions" ("user_id", "pet_type", "breed", "age", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    adoption = Adoption.all
---
SELECT "adoptions".* FROM "adoptions"