app/controllers/api/v1/comments_controller.rb

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 19]]
INSERT INTO "comments" ("comment_message", "user_id", "post_id", "username") VALUES (?, ?, ?, ?)  [["comment_message", "Ronaldo is the best footballer"], ["user_id", 19], ["post_id", 12], ["username", "anonymous"]]
UPDATE "feeds" SET "comment_count" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["comment_count", 1], ["updated_at", "2016-06-20 02:42:01.575302"], ["id", 9]]
UPDATE "users" SET "notifications" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def addcomment
    feed = Feed.find(params[:pid])

    message = params[:comment]
    uid = params[:uid]
    pid = params[:pid]

    #notif
    user = User.find(uid)
    uname = user.username
    prof = user.imageurl
    postpic = feed.smallimageurl
    @notif = "#{uname}[#{uid}][#{prof}] commented on your post[#{pid}][#{postpic}]"
    #end notif
    comment = Comment.new({comment_message: message, user_id: uid, post_id: pid})

    feed.comment_count = feed.comment_count + 1

    #notif
    x_id = feed.user_id
    userx = User.find(x_id)
    userx.notify << @notif
    #end notif
    if comment.save && feed.save && userx.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 12]]
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT 1  [["post_id", 21]]
---
  def showcomment
    pid = params[:pid]
    comment = Comment.where(post_id: pid).all
    if comment.exists?