app/controllers/api/v1/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.recipient_id ='3') OR (conversations.sender_id = '3' AND conversations.recipient_id ='2'))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" IS NULL AND "conversations"."recipient_id" = 3) LIMIT 1
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 2], ["recipient_id", 3], ["created_at", "2016-07-18 08:27:20.609219"], ["updated_at", "2016-07-18 08:27:20.609219"]]
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hello"], ["conversation_id", 9], ["user_id", 5], ["created_at", "2016-07-18 09:17:52.139445"], ["updated_at", "2016-07-18 09:17:52.139445"]]
---
  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id],params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)
    end
    #render json: { conversation_id: @conversation.id }
    mssg = params[:body]
    c_id = @conversation.id
    u_id = params[:sender_id]
    message = Message.new({ body: mssg, conversation_id: c_id , user_id: u_id})

    if message.save

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.recipient_id ='5') OR (conversations.sender_id = '5' AND conversations.recipient_id ='2'))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 10]]
---
  def open
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id],params[:recipient_id]).first
      c_id = @conversation.id
      message = Message.where(conversation_id: c_id).all

SELECT "conversations".* FROM "conversations" WHERE "conversations"."sender_id" = ?  [["sender_id", 5]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."recipient_id" = ?  [["recipient_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
---
  def all
    r_id = []
    c_id = []
    u_id = params[:id]

    Conversation.where(sender_id: u_id).each do |u|
      r_id << u.recipient_id
    end

    Conversation.where(recipient_id: u_id).each do |x|
      r_id << x.sender_id
    end

    if r_id.count > 0
      user = User.find([r_id])