app/controllers/api/v1/feeds_controller.rb

INSERT INTO "feeds" ("user_id", "message", "like_count", "comment_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["message", "wow"], ["like_count", 0], ["comment_count", 0], ["created_at", "2016-06-14 10:17:50.825151"], ["updated_at", "2016-06-14 10:17:50.825151"]]
---
  def create
    id = params[:uid]
    msg = params[:message]
    img = params[:image]
    feed = Feed.new({user_id: id, message: msg, like_count: 0, comment_count: 0, image: img})
    feed.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "feeds" SET "likedby" = ?, "like_id" = ?, "like_count" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["likedby", "---\n- anonymous\n- anonymous\n"], ["like_id", 0], ["like_count", 2], ["updated_at", "2016-06-20 11:50:53.780144"], ["id", 11]]
UPDATE "users" SET "notifications" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["notifications", "---\n- Rooney[3] liked your post[19]\n"], ["updated_at", "2016-07-23 04:36:39.470585"], ["id", 19]]
---
  def likeit
    feed = Feed.find(params[:pid])
    uid = params[:uid]
    pid = params[:pid]
    #notif
    user = User.find(uid)
    uname = user.username
    @notif = "#{uname}[#{uid}] liked your post[#{pid}]"
    #end notif
    if feed.likedby.include?(uid)
      render json: {errors: "already liked"}, status: 422
    else
      feed.likedby[feed.like_count] = uid
      feed.like_count = feed.like_count + 1
      #notif
      x_id = feed.user_id
      userx = User.find(x_id)
      userx.notifications << @notif
      #end notif
      if feed.save && userx.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (13, 12, 11, 10, 14, 15, 16)
---
  def showlikes
    l_id = []
    feed = Feed.find(params[:pid])
    l_id << feed.likedby
    if feed.likedby.count > 0
      user = User.find([l_id])

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "feeds" SET "likedby" = ?, "like_count" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["likedby", "---\n- '12'\n- '11'\n- '10'\n- '14'\n- '15'\n- '16'\n"], ["like_count", 6], ["updated_at", "2016-07-21 07:05:48.208488"], ["id", 21]]
---
  def dislikeit
    feed = Feed.find(params[:pid])
    uid = params[:uid]
    if feed.likedby.include?(uid)
      feed.likedby.delete(uid)
      feed.like_count = feed.like_count - 1
      if feed.save

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "feeds" SET "report" = ?, "report_count" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["report", 0], ["report_count", 1], ["updated_at", "2016-06-24 01:45:05.655082"], ["id", 21]]
---
  def report
    feed = Feed.find(params[:pid])
    repstr = params[:report]
    rep = repstr.to_i
    count = feed.report.count
    feed.report[count] = rep
    if feed.save

SELECT "feeds".* FROM "feeds"
---
  def index
    feeds = Feed.all

SELECT "users".* FROM "users" WHERE ("users"."id" != ?) AND (users.lat IS NOT NULL AND users.lng IS NOT NULL) AND (users.lat>19.119920014714644 AND users.lat<19.14883398528536 AND users.lng>72.7981865937463 AND users.lng<72.82879140625371) AND ((
SELECT "users".* FROM "users"
---
  def nearbyfeeds
    uid = params[:uid]
    user = User.find(params[:uid])
    latstr = user.lat
    longstr = user.lng
    @lat = latstr.to_f
    @long = longstr.to_f
    nearbyuser = User.where.not(id: uid).within(10, origin: [@lat,@long])

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 12]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" IN (1, 2, 3, 4, 5)
---
  def followeduserfeeds
    r_id = []
    u_id = params[:uid]
    Follow.where(follower_id: u_id).each do |u|
    r_id << u.following_id.to_i
    end
    if r_id.count > 0
      feed = Feed.where(user_id: [r_id])

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", 15]]
---
  def timeelapsed
    feed = Feed.find(params[:id])