app/controllers/api/v1/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    respond_with Product.find(params[:id])

SELECT "products".* FROM "products"
---
  def index
    respond_with Product.all