app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "im_tanzeel@yahoo.co.in"]]
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_sign_in_at", "2016-06-13 06:16:42.361955"], ["current_sign_in_at", "2016-06-13 06:27:10.717629"], ["sign_in_count", 3], ["updated_at", "2016-06-13 06:27:10.719387"], ["id", 7]]
---
def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user and user.valid_password? user_password
      sign_in user
      user.generate_authentication_token!
      user.save

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = ? LIMIT 1  [["auth_token", "9-WgUTq-7WsWHgXbXG-W"]]
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["auth_token", "Ad4wMRzbvKzT73wUZiXo"], ["updated_at", "2016-06-09 04:39:32.641404"], ["id", 1]]
---
def destroy
    user = User.find_by(auth_token: params[:id])
    user.generate_authentication_token!
    user.save