app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "ameyavi1@gmail.com"]]
UPDATE "users" SET "auth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["auth_token", "-gcF3QaYUgQarRissbiG"], ["updated_at", "2016-07-25 13:27:14.144342"], ["id", 28]]
---
  def new
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user and user.valid_password?(user_password)
      user.generate_authentication_token!
      user.save