app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "username", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?, ?)
---
  def new
    user_password = params[:password]
    user_email = params[:email]
    user=User.new({email: user_email,password: user_password, username: "anonymous"})
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "username" = ?, "pet_type" = ?, "pet_breed" = ?, "lat" = ?, "lng" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "anthony martial"], ["pet_type", "dog"], ["pet_breed", "labrador"], ["lat", nil], ["lng", nil], ["updated_at", "2016-07-24 15:24:39.080578"], ["id", 1]]
---
  def info
    user=User.find(params[:id])
    o_t = params[:otype]
    user.owner_type=o_t.downcase
    u = params[:username]
    user.username = u.downcase
    p_t = params[:ptype]
    user.pet_type = p_t.downcase
    b = params[:breed]
    user.pet_breed = b.downcase
    lat = params[:lat]
    lng = params[:lng]


    res=Geokit::Geocoders::GoogleGeocoder.reverse_geocode "#{lat},#{lng}"
    user.city = res.city

    user.lat = lat
    user.lng = lng
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "pet_story" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pet_story", "My dog is the best"], ["updated_at", "2016-06-23 05:06:38.307358"], ["id", 2]]
---
  def poststory

    user = User.find(params[:id])
    user.pet_story = params[:story]

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
---
  def showprofile
    user = User.find(params[:id])

SELECT  1 AS one FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."following_id" = ? LIMIT 1  [["follower_id", 19], ["following_id", 1]]
---
  def checkfollowing
    already_following = false
    follower = params[:myid]
    following = params[:hisid]
    follow = Follow.where({ follower_id: follower, following_id: following})
    if follow.exists?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "story_like_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["story_like_count", 1], ["updated_at", "2016-06-23 05:13:27.262627"], ["id", 2]]
---
  def likestory
    user = User.find(params[:id])
    user.story_like_count = user.story_like_count + 1
    if user.save

SELECT "feeds".* FROM "feeds" WHERE "feeds"."user_id" = ?  [["user_id", 2]]
SELECT  1 AS one FROM "feeds" WHERE "feeds"."user_id" = ? LIMIT 1  [["user_id", 12]]
---
  def userposts
    uid = params[:id]
    feed = Feed.where(user_id: uid).all
    if feed.exists?

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
---
  def follow
    follower = params[:myid]
    following = params[:hisid]
    already_following = false

    #notif got who's following you
    user = User.find(follower)

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 19]]
SELECT  1 AS one FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."following_id" = ? LIMIT 1  [["follower_id", 19], ["following_id", 1]]
---



    follow = Follow.where({ follower_id: follower, following_id: following})
    if follow.exists?

INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 19], ["following_id", 1], ["created_at", "2016-06-24 03:33:51.040427"], ["updated_at", "2016-06-24 03:33:51.040427"]]
UPDATE "users" SET "notifications" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["notifications", "---\n- Allen[11] followed you\n"], ["updated_at", "2016-07-23 05:15:32.516309"], ["id", 13]]
---

      #notif
        userx = User.find(following)
        userx.notify << @notif
        userx.followers = userx.followers + 1
      #end notif
      if follow.save && userx.save

SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19) AND (users.lat IS NOT NULL AND users.lng IS NOT NULL) AND (users.lat>12.277150735732043 AND users.lat<13.722849264267953 AND users.lng>13.25813892857053 AND users.lng<14.741861071429474) AND ((
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ?  [["follower_id", 19]]
SELECT "users".* FROM "users"
---
  def discover
    # Discover users you havent followed within 50 miles of you
    f_id = []
    x_id = []
    d_id = []
    u_id = params[:id].to_i
    user = User.find(params[:id])
    latstr = user.lat
    longstr = user.lng
    @lat = latstr.to_f
    @long = longstr.to_f

    Follow.where(follower_id: u_id).each do |u|
    f_id << u.following_id.to_i
    end

    f_id << u_id

    User.all.each do |p|

SELECT "users".* FROM "users" WHERE (username,pet_breed,pet_type LIKE '%ZL%')
---
  def search
    query = params[:query]
    name = query.downcase
    parameter = params[:parameter]
    if parameter == 'user'
      @x = 'username'
    elsif parameter == 'type'
      @x = 'pet_type'
    elsif parameter == 'breed'
      @x = 'pet_breed'
    end

    user = User.where("#{@x} LIKE ?","#{name}%")

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 19]]
---
  def notification
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "token" = ?, "enabled" = ?, "platform" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "21AC6B44CC2051F35DEA1F33A47E6D7C85420F4DB99C01981EA595A770924D66"], ["enabled", "t"], ["platform", "iphone"], ["updated_at", "2016-10-07 04:53:59.403102"], ["id", 1]]
---
  def token
    tok = params[:token]
    ena = params[:enabled]
    pla = params[:platform]

    user = User.find(params[:id])
    user.token = tok
    user.enabled = ena
    user.platform = pla

    if user.save